<?php

return [
    'singular' => 'طريقة الدفع',
    'plural' => 'طرق الدفع',
    'empty' => 'لا يوجد وسوم.',
    'count' => 'عدد طرق الدفع',
    'search' => 'بحث',
    'select' => 'اختر طرق الدفع',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن طريقه دفع',
    'description' => 'عرض جميع طرق الدفع',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة طريقه دفع',
        'show' => 'عرض طرق الدفع',
        'edit' => 'تعديل طرق الدفع',
        'delete' => 'حذف طرق الدفع',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة طرق الدفع بنجاح.',
        'updated' => 'تم تعديل طرق الدفع بنجاح.',
        'deleted' => 'تم حذف طرق الدفع بنجاح.',
        'images_note' => 'الملفات المدعومة: jpg ، jpeg ، png | الحد الأقصى لحجم الملف: 3 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم طرق الدفع',
        '%name%' => 'اسم طرق الدفع',
        'empty' => 'لا يوجد بيانات',
        'active' => 'طريقه الدفع فعالة',
        'created_at' => 'تاريخ الاضافة',
        'image' => 'الصورة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف طريقه الدفع ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
