<?php

return [
    'singular' => 'منطقة توصيل',
    'plural' => 'مناطق توصيل',
    'empty' => 'لا يوجد مناطق توصيل.',
    'count' => 'عدد مناطق توصيل',
    'search' => 'بحث',
    'select' => 'اختر منطقة توصيل',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منطقة توصيل',
    'outside_area' => 'العنوان خارج مناطق التوصيل',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منطقة توصيل',
        'show' => 'عرض منطقة توصيل',
        'edit' => 'تعديل منطقة توصيل',
        'delete' => 'حذف منطقة توصيل',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة منطقة توصيل بنجاح.',
        'updated' => 'تم تعديل منطقة توصيل بنجاح.',
        'deleted' => 'تم حذف منطقة توصيل بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم منطقة توصيل',
        'image' => 'صورة منطقة توصيل',
        'price' => 'سعر منطقة توصيل',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف منطقة توصيل ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
