<?php

return [

    'new' => [
        'user' => [
            'subject' => 'تم ارسال طلبك ',
            'body'    => 'شكرا لطلبك, اضغط هنا لمتابعه طلبك'
        ],
        'admin' => [
            'subject' => 'طلب جديد',
            'body'    => 'يوجد طلب جديد رقم :id'
        ],
    ],

    'change-status' => [
        'subject' => 'لقد تم تغيير حالة طلبك',
        'body'    => 'لقد تم تغيير حالة طلبك :id الي :status'
    ],

    'refund' => [
        'user' => [
            'true' => [
                'subject' => 'لقد تم ارسال طلب الاسترداد الخاص بالطلب #:id.',
                'body'    => 'لقد تم الاسترداد بنجاح'
            ],
            'false' => [
                'subject' => 'لقد تم ارسال طلب الاسترداد الخاص بالطلب #:id.',
                'body'    => 'يرجي مراجعة الدعم لاستكمال الاسترداد بنجاح'
            ]

        ]
    ],

    'cancelled' => [
        'user' => [
            'subject'             => 'تم الغاء طلبك',
            'body'                => 'قام المتجر بإلغاء رقم الطلب #:id وتم ارجاع مبلغ :payment الي رصيد محفظك',
            'body_reason_payment' => 'قام المتجر بإلغاء رقم الطلب #:id, وذلك بسبب :reason وتم ارجاع مبلغ :payment الي رصيد محفظك',
            'body_payment'        => 'قام المتجر بإلغاء رقم الطلب #:id, وتم ارجاع مبلغ :payment الي رصيد محفظك',
            'body_reason'         => 'قام المتجر بإلغاء رقم الطلب #:id, وذلك بسبب :reason',
        ],
        'admin' => [
            'subject'     => 'قام عمبل بالغاء طلب',
            'body'        => 'قام العميل بإلغاء رقم الطلب #:id',
            'body_reason' => 'قام العميل بإلغاء رقم الطلب #:id, وذلك بسبب :reason',
        ],

        'subject'     => 'تم الغاء طلب',
        'body'        => 'قام العميل بإلغاء رقم الطلب #:id',
        'body_reason' => 'قام العميل بإلغاء رقم الطلب #:id, وذلك بسبب :reason',
        'system_body' => 'تم إلغاء طلبك رقم #:id, بسبب تخطى الوقت المسموح لقبول الطلب او إسناد الطلب لسائق التوصيل من قبل المتجر.'
    ],
];
