<?php

return [
    'singular' => 'تقييم المنتج',
    'plural' => 'تقييمات المنتجات',
    'reports' => 'التقارير',
    'empty' => 'لا يوجد تقييمات.',
    'received_today' => 'التقييمات تم استقبالها اليوم',
    'delivered_today' => 'التقييمات تم تقييمها اليوم',
    'count' => 'عدد التقييمات',
    'search' => 'بحث',
    'select' => 'اختر التقييم',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن تقييم',
    'action' => 'الاجراء',
    'actions' => [
        'list' => 'عرض كل التقييمات',
        'create' => 'اضافة تقييم',
        'show' => 'عرض التقييم',
        'edit' => 'تعديل الطلب',
        'delete' => 'حذف التقييم',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'choose' => 'اختر شركة الشحن',
        'status' => 'تغيير حالة التقييم',
        'last_ten_orders' => 'اخر 10 طلبات',
        'download' => 'تحميل',
    ],
    'messages' => [
        "activated" => "تم قبول التقييم بنجاح.",
        "deactivated" => "تم رفض التقييم بنجاح.",
    ],
    'attributes' => [
        'id' => 'رقم التقييم',
        'rate' => 'التقييم',
        'comment' => 'الرأي',
    ]

];
