<?php

return [
    'singular' => 'منطقة محظورة',
    'plural' => 'مناطق محظورة',
    'empty' => 'لا يوجد مناطق محظورة.',
    'count' => 'عدد مناطق محظورة',
    'search' => 'بحث',
    'select' => 'اختر منطقة محظورة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منطقة محظورة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منطقة محظورة',
        'show' => 'عرض منطقة محظورة',
        'edit' => 'تعديل منطقة محظورة',
        'delete' => 'حذف منطقة محظورة',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة منطقة محظورة بنجاح.',
        'updated' => 'تم تعديل منطقة محظورة بنجاح.',
        'deleted' => 'تم حذف منطقة محظورة بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم منطقة محظورة',
        'image' => 'صورة منطقة محظورة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف منطقة محظورة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
