<?php

return [
    'singular' => 'الجائزة',
    'plural' => 'الجوائز',
    'empty' => 'لا يوجد جوائز.',
    'count' => 'عدد الجوائز',
    'search' => 'بحث',
    'select' => 'اختر الجائزة',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن جائزة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة جائزة',
        'show' => 'عرض الجائزة',
        'edit' => 'تعديل الجائزة',
        'delete' => 'حذف الجائزة',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة الجائزة بنجاح.',
        'updated' => 'تم تعديل الجائزة بنجاح.',
        'deleted' => 'تم حذف الجائزة بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم الجائزة',
        'url' => 'رابط الجائزة',
        'image' => 'صورة الجائزة',
        'date' => 'تاريخ الجائزة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الجائزة ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
