<?php

return [
    'singular' => 'خيار الخاصية',
    'plural' => 'خيارات الخصائص',
    'empty' => 'لا يوجد خيارات خصائص.',
    'count' => 'عدد خيارات الخصائص',
    'search' => 'بحث',
    'select' => 'اختر خيار الخاصية',
    'perPage' => 'عدد النتائج بالصفحة',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة خيار خاصية',
        'show' => 'عرض خيار الخاصية',
        'edit' => 'تعديل خيار الخاصية',
        'delete' => 'حذف خيار الخاصية',
        'options' => 'خيارات',
        'save' => 'حفظ',
    ],
    'messages' => [
        'created' => 'تم اضافة خيار الخاصية بنجاح.',
        'updated' => 'تم تعديل خيار الخاصية بنجاح.',
        'deleted' => 'تم حذف خيار الخاصية بنجاح.',
    ],
    'attributes' => [
        'name'                  => 'اسم خيار الخاصية',
        'name_ar'               => 'اسم خيار الخاصية باللغة العربية',
        'name_en'               => 'اسم خيار الخاصية باللغة الانجليزية',
        '%name%'                => 'اسم خيار الخاصية',
        'additional_price'      => 'السعر الاضافي',
        'is_default'            => 'افتراضي',
        'image'                 => 'الصورة',
        'icon'                  => 'الايقونة',
        'no_image'              => 'لا يوجد صورة',
        'no_icon'               => 'لا يوجد ايقونة',
        'pricing_matrix_active' => 'بعض خيارات الخاصية ليست في مصفوفة التسعير',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف خيار الخاصية ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
    'types' => [
        'text_option' => 'كتابية',
        'select_option' => 'خيارات',
    ],
];
