<?php

return [
    'singular' => 'الخيار',
    'plural'   => 'الخيارات',
    'empty'    => 'لا يوجد خيارات.',
    'count'    => 'عدد الخيارات',
    'search'   => 'بحث',
    'select'   => 'اختر الخيار',
    'perPage'  => 'عدد النتائج بالصفحة',
    'filter'   => 'ابحث عن الخيار',
    'actions'  => [
        'list'    => 'عرض الكل',
        'main'    => 'الاقسام الرئيسية',
        'sub'     => 'الاقسام الفرعية',
        'create'  => 'اضافة خيار',
        'show'    => 'عرض الخيار',
        'edit'    => 'تعديل الخيار',
        'delete'  => 'حذف الخيار',
        'options' => 'خيارات',
        'save'    => 'حفظ',
        'filter'  => 'بحث',
        'order'   => 'ترتيب الخيارات',
    ],
    'messages' => [
        'created'     => 'تم اضافة الخيار بنجاح.',
        'updated'     => 'تم تعديل الخيار بنجاح.',
        'deleted'     => 'تم حذف الخيار بنجاح.',
        'ordered'     => 'تم ترتيب الخيارات بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name'        => 'اسم الخيار',
        'description' => 'الوصف',
        'brief'       => 'وصف قصير',
        'image'       => 'صورة الخيار',
    ],
    'dialogs' => [
        'delete' => [
            'title'   => 'تحذير !',
            'info'    => 'هل انت متأكد انك تريد حذف الخيار ؟',
            'confirm' => 'حذف',
            'cancel'  => 'الغاء',
        ],
    ],
];
