<?php

return [
    'plural' => 'الخدمات الفرعية',
    'trashedPlural' => 'الخدمات الفرعية المحذوفين',
    'singular' => 'الخدمة الفرعية',
    'in' => 'في',
    'parent' => 'الخدمة الرئيسي',
    'empty' => 'لا يوجد اقسام',
    'select' => 'اختر الخدمة',
    'perPage' => 'عدد النتائج في الصفحة',
    'filter' => 'ابحث عن خدمة',
    'actions' => [
        'list' => 'كل الخدمات الفرعية',
        'show' => 'عرض',
        'create' => 'إضافة خدمة جديد',
        'new' => 'إضافة',
        'edit' => 'تعديل  الخدمة',
        'delete' => 'حذف الخدمة',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم إضافة الخدمة الفرعي بنجاح .',
        'updated' => 'تم تعديل الخدمة الفرعي بنجاح .',
        'deleted' => 'تم حذف الخدمة الفرعي بنجاح .',
    ],
    'attributes' => [
        'name' => 'الاسم',
        'image' => 'الصورة',
        'description' => 'الوصف',
        'additional_image' => 'صورة اضافية',
        'parent_id' => 'الخدمة الرئيسي',
        'status' => 'الحالة',
        'where_to_serve' => 'مكان تقديم الخدمة',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل أنت متأكد أنك تريد حذف هذا الخدمة الفرعي ؟',
            'confirm' => 'حذف',
            'cancel' => 'إلغاء',
        ]
    ],


    "where_to_serve" => [
        "in" => "داخل المغسلة",
        "out" => "خارج المغسلة",
        "inOut" => "داخل و خارج المغسلة",
    ]
];
