<?php

return [
    'singular' => 'الاعلان',
    'plural'   => 'الاعلانات',
    'empty'    => 'لا توجد اعلانات.',
    'count'    => 'عدد الاعلانات',
    'search'   => 'بحث',
    'select'   => 'اختر الاعلان',
    'perPage'  => 'عدد النتائج بالصفحة',
    'filter'   => 'ابحث عن اعلان',
    'actions'  => [
        'list'    => 'عرض الكل',
        'create'  => 'اضافة اعلان',
        'order'   => 'ترتيب الاعلانات',
        'show'    => 'عرض الاعلان',
        'edit'    => 'تعديل الاعلان',
        'delete'  => 'حذف الاعلان',
        'options' => 'خيارات',
        'save'    => 'حفظ',
        'filter'  => 'بحث',
    ],
    'messages' => [
        'created'     => 'تم اضافة الاعلان بنجاح.',
        'updated'     => 'تم تعديل الاعلان بنجاح.',
        'deleted'     => 'تم حذف الاعلان بنجاح.',
        'ordered'     => 'تم ترتيب الاعلانات بنجاح.',
        'activated'   => 'تم تنشيط الاعلان بنجاح.',
        'deactivated' => 'تم إلغاء تنشيط الاعلان بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'title'  => 'عنوان الاعلان',
        'image'  => 'صورة الاعلان',
        'active' => "مفعل",
        'url'    => "الرابط",
    ],
    'dialogs' => [
        'delete' => [
            'title'   => 'تحذير !',
            'info'    => 'هل انت متأكد انك تريد حذف الاعلان ؟',
            'confirm' => 'حذف',
            'cancel'  => 'الغاء',
        ],
    ],
];
