<?php

return [
    'singular' => 'الاشعار',
    'plural' => 'الاشعارات',
    'empty' => 'لا يوجد اشعارات.',
    'count' => 'عدد الاشعارات',
    'search' => 'بحث',
    'select' => 'اختر الاشعار',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن اشعار',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'ارسال اشعار',
        'show' => 'عرض الاشعار',
        'edit' => 'تعديل الاشعار',
        'delete' => 'حذف الاشعار',
        'options' => 'خيارات',
        'save' => 'ارسال',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم ارسال الاشعار بنجاح.',
        'updated' => 'تم تعديل الاشعار بنجاح.',
        'deleted' => 'تم حذف الاشعار بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'user' => 'المستخدم',
        'title' => 'العنوان',
        'message' => 'المحتوى',
        'image' => 'صورة المستخدم',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف الاشعار ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
