<?php

return [
    'singular' => 'الخدمة',
    'plural'   => 'الخدمات',
    'empty'    => 'لا يوجد خدمات.',
    'count'    => 'عدد الخدمات',
    'search'   => 'بحث',
    'select'   => 'اختر الخدمة',
    'perPage'  => 'عدد النتائج بالصفحة',
    'filter'   => 'ابحث عن خدمة',
    'actions'  => [
        'main'      => 'الخدمات الرئيسية',
        'main_page' => 'الصفحة الرئيسية',
        'sub'       => 'الخدمات الفرعية',
        'list'      => 'عرض الكل',
        'create'    => 'اضافة خدمة',
        'show'      => 'عرض الخدمة',
        'edit'      => 'تعديل الخدمة',
        'delete'    => 'حذف الخدمة',
        'options'   => 'خيارات',
        'save'      => 'حفظ',
        'filter'    => 'بحث',
        'order'     => 'ترتيب الخدمات',
    ],
    'messages' => [
        'created'                    => 'تم اضافة الخدمة بنجاح.',
        'updated'                    => 'تم تعديل الخدمة بنجاح.',
        'cant-delete'                => 'لا يمكنك حذف هذه الخدمة لانها مستخدمة لدي بعض المتاجر.',
        'washer-service-cant-delete' => 'لا يمكنك حذف هذه الخدمة لانه يوجد طلبات معلقة...',
        'deleted'                    => 'تم حذف الخدمة بنجاح.',
        'ordered'                    => 'تم ترتيب الخدمات بنجاح.',
        'images_note'                => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name'               => 'اسم الخدمة',
        'title'              => 'عنوان الخدمة',
        'description'        => 'وصف الخدمة',
        'image'              => 'صورة الخدمة',
        'washer_id'          => 'المتجر',
        'service_id'         => 'الخدمة',
        'max_free_additions' => 'اقصي عدد للاضافات المجانية',
        'sizes'              => 'الاحجام',
        'price'              => 'السعر',
        'cover'              => 'خلفية الخدمة',
        'images'             => 'الصور',
        ''                   => '',
        ''                   => '',
        ''                   => '',
        ''                   => '',
    ],
    'dialogs' => [
        'delete' => [
            'title'   => 'تحذير !',
            'info'    => 'هل انت متأكد انك تريد حذف الخدمة ؟',
            'confirm' => 'حذف',
            'cancel'  => 'الغاء',
        ],
    ],


    'services' => [
        'shipping'      => 'الشحن والتوصيل',
        'attachCompany' => 'الربط مع مصانع',
    ]

];
